{
    "title":"Tap Champion",
    "github-source":"https://github.com/Naxden/TapChampion/tree/master",
    "download-link": "",
    "introduction": "Tap Champion is my clone of “Guitar Hero” mixed with “Osu!” and “Genshin Impact”s event-mini game. The project is designed and coded entirely by myself. I want to focus on usability and the backend side of it. In the future I plan to work on the general appearance and aesthetics (UI, Animations, Shaders). Since Tap Champion is still in development, this post will also be changed. I have built whole Song System or actually - “.tapch” files, which are my way of storing and sharing songs. This kind of file stores information about.\nThe actual sound track. The only extension that my game supports is “.mp3”.\nThe background image of the song. The extensions are “.png” or “.jpg”.\nLastly NoteFile. Which has basic information about song and maps of actual notes divided into 3 difficulty levels.\nMy game has short and long notes, which are distinguished by the time the key is pressed.",
    "feature_number": 5,
    "feature_1_title": "Main menu",
    "feature_1": "A simple menu with a few key options, such as choosing whether the player wants to Play, Record, or Import songs. Songs to import should be in “Download” folder and has “.tapch” extension. They will be placed in “Songs” folder.",
    "feature_2_title": "Recording",
    "feature_2": "This stage is intended for recording a song “from scratch”, or for editing an existing one. It starts by loading a song using the “Load Song” button, where the player has to select an “.mp3” file. The game automatically detects if the track already exist in the game's “Songs” folder. Based on the selected mp3 file name, the game tries to load other information. The player can then add notes by pressing the mapped keys to record the notes. Notes can be deleted, moved over timeline and moved to other tracks (keys).\nChanges will be saved after clicking the “Save Song” button and by completing the song information. I want to do as much of the work myself as possible, but I also want to use one of Unity's biggest features, the Asset Store. For this reason I used a simple file browser.",
    "feature_3_title": "Song Selection",
    "feature_3": "The stage where the saved songs are loaded, from which the player can select the ones he wants to play and add them to the playlist. Clicking of song results in playing short demo of it.\nThere is also an option to export loaded song into “.tapch” file, which will be saved in “Download” folder.",
    "feature_4_title": "Game",
    "feature_4": "The player can play a previously selected song. I tried to mimic Genishin's approach and design. However I prefer Guitar Hero's gameplay, so I did my best combine their adventages. As the player hits the notes, the multiplier increases rewarding the player with more points. The multiplier resets when the player fails to hit a note, or when he presses a button even though there is no note on it. At the end player's scores is updated and saved to played song.",
    "feature_5_title": "Settings",
    "feature_5": "Multi level overlay, where player can:\n -select the difficulty\n -adjust volume\n -change key binds\n -change the lag offset\n"
}